package ua.khpi.oop.radeivych01;

/**
 * Завдання: Обрати тип змінних та встановити за допомогою констант та 
 * літералів зідані початкові значення, використовуючи десятковий запис 
 * цілочисельного значення кожної змінної знайти і підрахувати кількість
 * парних і непарних цифр та використовуючи двійковий запис цілочисельного
 * значення кожної змінної підрахувати кількість одиниць.
 *
 * @author Radeivych Vladyslav
 */
public final class Main {
	/**
	 * Виконання поставленного завдання
	 * 
	 * @param args
	 */
        public static void main(String[] args) {
        	// 1 завдання
        	final int RecordBookNumber = 0x15;
        	final long NumberPhone = 380991234567l;
        	final long NumberPhoneOfBinary = 0b101100010000001000111111010010100010101L;
        	final long NumberPhoneOfOctal = 05420107722425l;
        	final int Num = ((21-1) % 26)+1;
        	final char Letter = 85;
        	
        	// 2 завдання
        	int[] Array;
        	Array = new int[10];
        	for(int i = 0; i < 10; i++) {
        		Array[i] = i + 1;
        	}
        	
        	int pair = 0;
        	int unpair = 0;
        	
        	for(int i = 0; i < 10; i++) {
        		if(Array[i] % 2 == 0 && Array[i] != 0) {
        			pair++;
        		} else {
        			unpair++;
        		}
        	}
        	
        	// 3 завдання
        	int One = 0;
        	int Null = 0;
        	int[] ArrayOfBinary;
        	ArrayOfBinary = new int[10];
        	ArrayOfBinary[0] = 1;
        	ArrayOfBinary[1] = 0;
        	ArrayOfBinary[2] = 1;
        	ArrayOfBinary[3] = 0;
        	
        	for(int i = 0; i < 10; i++) {
        		if(ArrayOfBinary[i] == 0) {
        			Null++;
        		} if(ArrayOfBinary[i] == 1) {
        			One++;
        		}
        	}
        	
        	int[] Arr = {110, 115, 122, 128, 115, 118, 116, 124, 120, 127, 136, 129,
        				119, 124, 131, 116, 108, 122, 118, 132, 118, 118, 116, 132,
        				124, 120, 124, 124, 118, 127, 126, 119, 115, 122, 131, 129, 
        				128, 122, 103, 125, 115, 122, 114, 109, 132, 122, 121, 129,
        				108, 111, 104, 115, 105, 135, 132, 133, 119, 137, 126, 102, 
        				114, 109, 125, 121, 112, 131, 115, 122, 118, 116, 130, 126, 
        				131, 127, 116, 120, 119, 128, 104, 131, 115, 140, 115, 124,
        				126, 115, 104, 125, 131, 117, 118, 102, 127, 120, 102, 120, 
        				130, 128, 106, 132, 129, 131, 126, 116, 128, 134, 132, 124,
        				107, 119, 132, 117, 120, 122, 114, 125, 139, 116, 125, 132,
        				111, 122, 120, 113, 123, 119, 122, 112, 125, 101, 121, 124, 
        				110, 123, 141, 115, 121, 113, 125, 139, 111, 117, 114, 109,
        				128, 126, 139, 114, 123, 125, 123, 118, 129, 123, 124, 122,
        				123, 120, 115, 115, 127, 115, 114, 133, 128, 123, 104, 124, 
        				105, 124, 112, 135, 117, 127, 134, 117, 120, 97, 123, 105, 
        				108, 119, 112, 114, 133, 112, 120, 145, 121, 126, 127, 118, 
        				129};
        	
        	int result = 0;
        	for(int i = 0; i < Arr.length; i++) {
        		if(Arr[i] >= 140 && Arr[i] < 145) {
        			result++;
        		}
        	}
            System.out.printf("Всего: %d \n", result);
        } 
        
}